Case2_Amplitude_Modulation/system/controlDict
/*----------------*- C++ -*--------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  www.openfoam.com
    \\  /    A nd           | Version:  v2412
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

//startFrom       startTime;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         40;

deltaT          0.0005;

writeControl    adjustable;
writeInterval   0.1;

purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;

timeFormat      general;

runTimeModifiable true;

adjustTimeStep  yes;
maxCo           0.3;
maxAlphaCo      0.2;
maxDeltaT       0.002;

functions
{
    waveProbes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;
        probeLocations
        (
            ( 0.13125  0.0     0.225)
            ( 0.0      0.13125 0.225)
        );
        fields          (p_rgh alpha.water);
    }

    wallForces
    {
        type            forces;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;
        patches         ("wall");
        rho             rhoInf;
        rhoInf          998;
        CofR            (0 0 0);
    }
}

// ************************************************************************* //